ua1arn/hftrx/boards/arm_stm32h7xx_tqfp100_ctlstyle_storch_v7z_vt.h
	#if WITHPOTWPM
		POTWPM = 6,			// PA6 потенциометр управления скоростью передачи в телеграфе
	#endif /* WITHPOTWPM */
	#if WITHPOTPOWER
		POTPOWER = 6,			// регулировка мощности
	#endif /* WITHPOTPOWER */

	#if WITHTHERMOLEVEL
		XTHERMOIX = 9,		// PB1 Exernal thermo sensor ST LM235Z
	#endif /* WITHTHERMOLEVEL */

	#if WITHCURRLEVEL
		//PASENSEIX = BOARD_ADCXIN(0),		// MCP3208 CH0 PA current sense - ACS712-30 chip
		PASENSEIX = 2,		// PA2 PA current sense - ACS712-05 chip
	#endif /* WITHCURRLEVEL */

	#if WITHSWRMTR
		//FWD = BOARD_ADCXIN(2), REF = BOARD_ADCXIN(3),		// MCP3208 CH2, CH3 Детектор прямой, отраженной волны
		FWD = 14, REF = 15,	// PC5	SWR-meter
		PWRI = FWD,			// PC4
	#endif /* WITHSWRMTR */

		XTHERMOMRRIX = BOARD_ADCMRRIN(0),	// кеш - индекc не должен повторяться в конфигурации
		PASENSEMRRIX = BOARD_ADCMRRIN(1),	// кеш - индекc не должен повторяться в конфигурации
		REFMRRIX = BOARD_ADCMRRIN(2),
		FWDMRRIX = BOARD_ADCMRRIN(3),
		PWRMRRIX = FWDMRRIX,
		VOLTMRRIX = BOARD_ADCMRRIN(4),	// кеш - индекc не должен повторяться в конфигурации
		PASENSEMRRIX2 = BOARD_ADCMRRIN(5),		// кеш - индекc не должен повторяться в конфигурации
		PAREFERMRRIX2 = BOARD_ADCMRRIN(6),		// кеш - индекc не должен повторяться в конфигурации

		KI0 = 10, KI1 = 11, KI2 = 12, KI3 = 0, KI4 = 1	// клавиатура
	};

	#define KI_COUNT 5	// количество используемых под клавиатуру входов АЦП
	#define KI_LIST	KI4, KI3, KI2, KI1, KI0,	// инициализаторы для функции перекодировки

	#define BOARD_NOTCH_OFF		0	// stub
	#define BOARD_NOTCH_MANUAL	1	// stub

	#define WITHLCDBACKLIGHTMAX 0

#endif /* ARM_STM32H7XX_TQFP176_CTLSTYLE_STORCH_V7_NO_RADIO_H_INCLUDED */
